---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarDeformationType
source: html/43f6921e-179f-ce9d-5209-f1182bf50d14.htm
---
# Autodesk.Revit.DB.Structure.RebarDeformationType

Bar deformation type

## Syntax (C#)
```csharp
public enum RebarDeformationType
```